Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_RHR" edc:nzwidth="0x20" edc:access="----------------r------rrrrrrrrr" edc:impl="0x81FF" edc:_addr="0x4000C218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:nzwidth="0x9" edc:desc="Received Character"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:nzwidth="0x1" edc:desc="Received Sync"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_THR" edc:nzwidth="0x20" edc:access="----------------w------wwwwwwwww" edc:impl="0x81FF" edc:_addr="0x4000C21C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:nzwidth="0x9" edc:desc="Character to be Transmitted"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:nzwidth="0x1" edc:desc="Sync Field to be Transmitted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_BRGR" edc:nzwidth="0x20" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:impl="0x7FFFF" edc:_addr="0x4000C220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="CD" edc:nzwidth="0x10" edc:desc="Clock Divider"/>
            <edc:SFRFieldDef edc:cname="FP" edc:nzwidth="0x3" edc:desc="Fractional Part"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_RTOR" edc:nzwidth="0x20" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:impl="0x1FFFF" edc:_addr="0x4000C224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TO" edc:nzwidth="0x11" edc:desc="Time-out Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_TTGR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4000C228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TG" edc:nzwidth="0x8" edc:desc="Timeguard Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x4000C22C"/>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_FIDI" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4000C240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="FI_DI_RATIO" edc:nzwidth="0x10" edc:desc="FI Over DI Ratio Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_NER" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x4000C244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="NB_ERRORS" edc:nzwidth="0x8" edc:desc="Number of Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4000C248"/>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_IF" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4000C24C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:nzwidth="0x8" edc:desc="IrDA Filter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4000C250"/>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LINMR" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x4000C254">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="NACT" edc:nzwidth="0x2" edc:desc="LIN Node Action">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:nzwidth="0x1" edc:desc="Parity Disable"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:nzwidth="0x1" edc:desc="Checksum Disable"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:nzwidth="0x1" edc:desc="Checksum Type"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:nzwidth="0x1" edc:desc="Data Length Mode"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:nzwidth="0x1" edc:desc="Frame Slot Mode Disable"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:nzwidth="0x1" edc:desc="Wakeup Signal Type"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:nzwidth="0x8" edc:desc="Data Length Control"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:nzwidth="0x1" edc:desc="PDC Mode"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:nzwidth="0x1" edc:desc="Synchronization Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_LINIR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4000C258">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:nzwidth="0x8" edc:desc="Identifier Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
