Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_CSR" edc:nzwidth="0x20" edc:access="--------rr--r-----rrrrrrrrrrrrrr" edc:impl="0xC83FFF" edc:_addr="0x40018214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready (cleared by reading US_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmitter Ready (cleared by writing US_THR)"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Break Received/End of Break (cleared by writing a one to the bit US_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing US_RCR or US_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing US_TCR or US_TNCR)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (cleared by writing a one to the bit US_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error (cleared by writing a one to the bit US_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error (cleared by writing a one to the US_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Receiver Time-out (cleared by writing a one to the bit US_CR.STTTO)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmitter Empty (cleared by writing US_THR)"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:nzwidth="0x1" edc:desc="Max Number of Repetitions Reached (cleared by writing a one to the bit US_CR.RSTIT)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing US_RCR or US_RNCR)"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Non Acknowledge Interrupt (cleared by writing a one to the bit US_CR.RSTNACK)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear to Send Input Change Flag (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Status (cleared by writing a one to the bit US_CR.RSTSTA command)"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:nzwidth="0x1" edc:desc="Image of CTS Input"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_RHR" edc:nzwidth="0x20" edc:access="----------------r------rrrrrrrrr" edc:impl="0x81FF" edc:_addr="0x40018218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:nzwidth="0x9" edc:desc="Received Character"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:nzwidth="0x1" edc:desc="Received Sync"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_THR" edc:nzwidth="0x20" edc:access="----------------w------wwwwwwwww" edc:impl="0x81FF" edc:_addr="0x4001821C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:nzwidth="0x9" edc:desc="Character to be Transmitted"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:nzwidth="0x1" edc:desc="Sync Field to be Transmitted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_BRGR" edc:nzwidth="0x20" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:impl="0x7FFFF" edc:_addr="0x40018220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="CD" edc:nzwidth="0x10" edc:desc="Clock Divider"/>
            <edc:SFRFieldDef edc:cname="FP" edc:nzwidth="0x3" edc:desc="Fractional Part"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_RTOR" edc:nzwidth="0x20" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:impl="0x1FFFF" edc:_addr="0x40018224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="TO" edc:nzwidth="0x11" edc:desc="Time-out Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_TTGR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40018228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="TG" edc:nzwidth="0x8" edc:desc="Timeguard Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x4001822C"/>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_FIDI" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40018240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="FI_DI_RATIO" edc:nzwidth="0x10" edc:desc="FI Over DI Ratio Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_NER" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x40018244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="NB_ERRORS" edc:nzwidth="0x8" edc:desc="Number of Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40018248"/>
      <edc:SFRDef ltx:memberofperipheral="USART3" edc:cname="US_IF" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4001824C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART3">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:nzwidth="0x8" edc:desc="IrDA Filter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
