Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003800C"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHER" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Enable"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Enable"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Enable"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Enable"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHDR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40038014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Disable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Disable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Disable"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Disable"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Disable"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Disable"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Disable"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHSR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x40038018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Status"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Status"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Status"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Status"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Status"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Status"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Status"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003801C"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_LCDR" edc:nzwidth="0x20" edc:access="---rrrrr--------rrrrrrrrrrrrrrrr" edc:impl="0x1F00FFFF" edc:_addr="0x40038020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LDATA" edc:nzwidth="0x10" edc:desc="Last Data Converted"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNBOSR" edc:nzwidth="0x5" edc:desc="Channel Number in Oversampling Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IER" edc:nzwidth="0x20" edc:access="---wwwww----w-----------wwwwwwww" edc:impl="0x1F0800FF" edc:_addr="0x40038024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 7"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:nzwidth="0x1" edc:desc="Last Channel Change Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IDR" edc:nzwidth="0x20" edc:access="---wwwww----w-----------wwwwwwww" edc:impl="0x1F0800FF" edc:_addr="0x40038028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 7"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:nzwidth="0x1" edc:desc="Last Channel Change Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IMR" edc:nzwidth="0x20" edc:access="---rrrrr----r-----------rrrrrrrr" edc:impl="0x1F0800FF" edc:_addr="0x4003802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 7"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:nzwidth="0x1" edc:desc="Last Channel Change Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
