Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_ISR" edc:nzwidth="0x20" edc:access="---rrrrr----r-----------rrrrrrrr" edc:impl="0x1F0800FF" edc:_addr="0x40038030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion 0 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion 1 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion 2 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion 3 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion 4 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion 5 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion 6 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion 7 (automatically set / cleared)"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:nzwidth="0x1" edc:desc="Last Channel Change (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_LCTMR" edc:nzwidth="0x20" edc:access="--------------------------nn---n" edc:impl="0x31" edc:_addr="0x40038034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DUALTRIG" edc:nzwidth="0x1" edc:desc="Dual Trigger ON"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMPMOD" edc:nzwidth="0x2" edc:desc="Last Channel Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_LCCWR" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x40038038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:nzwidth="0xC" edc:desc="Low Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:nzwidth="0xC" edc:desc="High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_OVER" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x4003803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:nzwidth="0x1" edc:desc="Overrun Error 0"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:nzwidth="0x1" edc:desc="Overrun Error 1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:nzwidth="0x1" edc:desc="Overrun Error 2"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:nzwidth="0x1" edc:desc="Overrun Error 3"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:nzwidth="0x1" edc:desc="Overrun Error 4"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:nzwidth="0x1" edc:desc="Overrun Error 5"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:nzwidth="0x1" edc:desc="Overrun Error 6"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:nzwidth="0x1" edc:desc="Overrun Error 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EMR" edc:nzwidth="0x20" edc:access="-------n--nn-nnn--nn--n-nnnn-nnn" edc:impl="0x13732F7" edc:_addr="0x40038040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x2" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMPTYPE" edc:nzwidth="0x1" edc:desc="Comparison Type">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any conversion is performed and comparison function drives the COMPE flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPSEL" edc:nzwidth="0x4" edc:desc="Comparison Selected Channel"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPALL" edc:nzwidth="0x1" edc:desc="Compare All Channels"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMPFILTER" edc:nzwidth="0x2" edc:desc="Compare Event Filtering"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x3" edc:desc="Over Sampling Rate">
              <edc:SFRFieldSemantic edc:cname="NO_AVERAGE" edc:desc="No averaging. ADC sample rate is maximum." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR4" edc:desc="1-bit enhanced resolution by averaging. ADC sample rate divided by 4." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR16" edc:desc="2-bit enhanced resolution by averaging. ADC sample rate divided by 16." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR64" edc:desc="3-bit enhanced resolution by averaging. ADC sample rate divided by 64." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR256" edc:desc="4-bit enhanced resolution by averaging. ADC sample rate divided by 256." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ASTE" edc:nzwidth="0x1" edc:desc="Averaging on Single Trigger Event">
              <edc:SFRFieldSemantic edc:cname="MULTI_TRIG_AVERAGE" edc:desc="The average requests several trigger events." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE_TRIG_AVERAGE" edc:desc="The average requests only one trigger event." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRCCLK" edc:nzwidth="0x1" edc:desc="External Clock Selection">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source for the ADC prescaler." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PMC_PCK" edc:desc="PMC PCKx is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TAG" edc:nzwidth="0x1" edc:desc="Tag of the ADC_LCDR"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:nzwidth="0x10" edc:desc="Low Threshold"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:nzwidth="0x10" edc:desc="High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40038048"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_COR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:impl="0xFF00FF" edc:_addr="0x4003804C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OFF0" edc:nzwidth="0x1" edc:desc="Offset for Channel 0"/>
            <edc:SFRFieldDef edc:cname="OFF1" edc:nzwidth="0x1" edc:desc="Offset for Channel 1"/>
            <edc:SFRFieldDef edc:cname="OFF2" edc:nzwidth="0x1" edc:desc="Offset for Channel 2"/>
            <edc:SFRFieldDef edc:cname="OFF3" edc:nzwidth="0x1" edc:desc="Offset for Channel 3"/>
            <edc:SFRFieldDef edc:cname="OFF4" edc:nzwidth="0x1" edc:desc="Offset for Channel 4"/>
            <edc:SFRFieldDef edc:cname="OFF5" edc:nzwidth="0x1" edc:desc="Offset for Channel 5"/>
            <edc:SFRFieldDef edc:cname="OFF6" edc:nzwidth="0x1" edc:desc="Offset for Channel 6"/>
            <edc:SFRFieldDef edc:cname="OFF7" edc:nzwidth="0x1" edc:desc="Offset for Channel 7"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DIFF0" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 0"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 2"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 3"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 4"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 5"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 6"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR0" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40038050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR1" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40038054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR2" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40038058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR3" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4003805C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR4" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40038060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR5" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40038064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR6" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40038068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR7" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4003806C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
