Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="TWI6" edc:cname="TWI6_PTSR" edc:nzwidth="0x20" edc:access="-------r-----r-r-------r-------r" edc:impl="0x1050101" edc:_addr="0x40040724">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI6">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x38D8" edc:_addr="0x40040728"/>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FRM_NUM" edc:nzwidth="0x20" edc:access="--------------rr-----rrrrrrrrrrr" edc:impl="0x307FF" edc:_addr="0x40044000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FRM_NUM" edc:nzwidth="0xB" edc:desc="Frame Number as Defined in the Packet Field Formats"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FRM_ERR" edc:nzwidth="0x1" edc:desc="Frame Error"/>
            <edc:SFRFieldDef edc:cname="FRM_OK" edc:nzwidth="0x1" edc:desc="Frame OK"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_GLB_STAT" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x40044004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FADDEN" edc:nzwidth="0x1" edc:desc="Function Address Enable"/>
            <edc:SFRFieldDef edc:cname="CONFG" edc:nzwidth="0x1" edc:desc="Configured"/>
            <edc:SFRFieldDef edc:cname="ESR" edc:nzwidth="0x1" edc:desc="Enable Send Resume"/>
            <edc:SFRFieldDef edc:cname="RSMINPR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RMWUPE" edc:nzwidth="0x1" edc:desc="Remote Wakeup Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FADDR" edc:nzwidth="0x20" edc:access="-----------------------n-nnnnnnn" edc:impl="0x17F" edc:_addr="0x40044008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FADD" edc:nzwidth="0x7" edc:desc="Function Address Value"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FEN" edc:nzwidth="0x1" edc:desc="Function Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4004400C"/>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_IER" edc:nzwidth="0x20" edc:access="------------------w-wwww--wwwwww" edc:impl="0x2F3F" edc:_addr="0x40044010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:nzwidth="0x1" edc:desc="Enable Endpoint 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:nzwidth="0x1" edc:desc="Enable Endpoint 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:nzwidth="0x1" edc:desc="Enable Endpoint 2Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:nzwidth="0x1" edc:desc="Enable Endpoint 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:nzwidth="0x1" edc:desc="Enable Endpoint 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:nzwidth="0x1" edc:desc="Enable Endpoint 5 Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:nzwidth="0x1" edc:desc="Enable UDP Suspend Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:nzwidth="0x1" edc:desc="Enable UDP Resume Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:nzwidth="0x1" edc:desc="Enable Start Of Frame Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Enable UDP Bus Wakeup Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_IDR" edc:nzwidth="0x20" edc:access="------------------w-wwww--wwwwww" edc:impl="0x2F3F" edc:_addr="0x40044014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:nzwidth="0x1" edc:desc="Disable Endpoint 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:nzwidth="0x1" edc:desc="Disable Endpoint 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:nzwidth="0x1" edc:desc="Disable Endpoint 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:nzwidth="0x1" edc:desc="Disable Endpoint 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:nzwidth="0x1" edc:desc="Disable Endpoint 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:nzwidth="0x1" edc:desc="Disable Endpoint 5 Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:nzwidth="0x1" edc:desc="Disable UDP Suspend Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:nzwidth="0x1" edc:desc="Disable UDP Resume Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:nzwidth="0x1" edc:desc="Disable Start Of Frame Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Disable USB Bus Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_IMR" edc:nzwidth="0x20" edc:access="------------------rrrrrr--rrrrrr" edc:impl="0x3F3F" edc:_addr="0x40044018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:nzwidth="0x1" edc:desc="Mask Endpoint 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:nzwidth="0x1" edc:desc="Mask Endpoint 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:nzwidth="0x1" edc:desc="Mask Endpoint 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:nzwidth="0x1" edc:desc="Mask Endpoint 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:nzwidth="0x1" edc:desc="Mask Endpoint 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:nzwidth="0x1" edc:desc="Mask Endpoint 5 Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:nzwidth="0x1" edc:desc="Mask UDP Suspend Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:nzwidth="0x1" edc:desc="Mask UDP Resume Interrupt."/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:nzwidth="0x1" edc:desc="Mask Start Of Frame Interrupt"/>
            <edc:SFRFieldDef edc:cname="BIT12" edc:nzwidth="0x1" edc:desc="UDP_IMR Bit 12"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="USB Bus Wakeup Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_ISR" edc:nzwidth="0x20" edc:access="------------------rrrrrr--rrrrrr" edc:impl="0x3F3F" edc:_addr="0x4004401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0INT" edc:nzwidth="0x1" edc:desc="Endpoint 0 Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="EP1INT" edc:nzwidth="0x1" edc:desc="Endpoint 1 Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="EP2INT" edc:nzwidth="0x1" edc:desc="Endpoint 2 Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="EP3INT" edc:nzwidth="0x1" edc:desc="Endpoint 3 Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="EP4INT" edc:nzwidth="0x1" edc:desc="Endpoint 4 Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="EP5INT" edc:nzwidth="0x1" edc:desc="Endpoint 5 Interrupt Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:nzwidth="0x1" edc:desc="UDP Suspend Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:nzwidth="0x1" edc:desc="UDP Resume Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:nzwidth="0x1" edc:desc="Start of Frame Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="ENDBUSRES" edc:nzwidth="0x1" edc:desc="End of BUS Reset Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="UDP Resume Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
