Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_ICR" edc:nzwidth="0x20" edc:access="------------------wwwwww--------" edc:impl="0x3F00" edc:_addr="0x40044020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="RXSUSP" edc:nzwidth="0x1" edc:desc="Clear UDP Suspend Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXRSM" edc:nzwidth="0x1" edc:desc="Clear UDP Resume Interrupt"/>
            <edc:SFRFieldDef edc:cname="EXTRSM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFINT" edc:nzwidth="0x1" edc:desc="Clear Start Of Frame Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDBUSRES" edc:nzwidth="0x1" edc:desc="Clear End of Bus Reset Interrupt"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Clear Wakeup Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40044024"/>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_RST_EP" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x40044028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="EP0" edc:nzwidth="0x1" edc:desc="Reset Endpoint 0"/>
            <edc:SFRFieldDef edc:cname="EP1" edc:nzwidth="0x1" edc:desc="Reset Endpoint 1"/>
            <edc:SFRFieldDef edc:cname="EP2" edc:nzwidth="0x1" edc:desc="Reset Endpoint 2"/>
            <edc:SFRFieldDef edc:cname="EP3" edc:nzwidth="0x1" edc:desc="Reset Endpoint 3"/>
            <edc:SFRFieldDef edc:cname="EP4" edc:nzwidth="0x1" edc:desc="Reset Endpoint 4"/>
            <edc:SFRFieldDef edc:cname="EP5" edc:nzwidth="0x1" edc:desc="Reset Endpoint 5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4004402C"/>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_CSR0" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:impl="0x7FF8FFF" edc:_addr="0x40044030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Generates an IN Packet with Data Previously Written in the DPR"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:nzwidth="0x1" edc:desc="Receive Data Bank 0"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:nzwidth="0x1" edc:desc="Received Setup"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:nzwidth="0x1" edc:desc="Stall Sent"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:nzwidth="0x1" edc:desc="Transmit Packet Ready"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:nzwidth="0x1" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:nzwidth="0x1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x3" edc:desc="Endpoint Type (Read/Write)">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:nzwidth="0x1" edc:desc="Data Toggle (Read-only)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:nzwidth="0x1" edc:desc="Endpoint Enable Disable"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:nzwidth="0xB" edc:desc="Number of Bytes Available in the FIFO (Read-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_CSR1" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:impl="0x7FF8FFF" edc:_addr="0x40044034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Generates an IN Packet with Data Previously Written in the DPR"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:nzwidth="0x1" edc:desc="Receive Data Bank 0"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:nzwidth="0x1" edc:desc="Received Setup"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:nzwidth="0x1" edc:desc="Stall Sent"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:nzwidth="0x1" edc:desc="Transmit Packet Ready"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:nzwidth="0x1" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:nzwidth="0x1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x3" edc:desc="Endpoint Type (Read/Write)">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:nzwidth="0x1" edc:desc="Data Toggle (Read-only)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:nzwidth="0x1" edc:desc="Endpoint Enable Disable"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:nzwidth="0xB" edc:desc="Number of Bytes Available in the FIFO (Read-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
