Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_CSR5" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnn---nnnnnnnnnnnn" edc:impl="0x7FF8FFF" edc:_addr="0x40044044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Generates an IN Packet with Data Previously Written in the DPR"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK0" edc:nzwidth="0x1" edc:desc="Receive Data Bank 0"/>
            <edc:SFRFieldDef edc:cname="RXSETUP" edc:nzwidth="0x1" edc:desc="Received Setup"/>
            <edc:SFRFieldDef edc:cname="STALLSENT" edc:nzwidth="0x1" edc:desc="Stall Sent"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:nzwidth="0x1" edc:desc="Transmit Packet Ready"/>
            <edc:SFRFieldDef edc:cname="FORCESTALL" edc:nzwidth="0x1" edc:desc="Force Stall (used by Control, Bulk and Isochronous Endpoints)"/>
            <edc:SFRFieldDef edc:cname="RX_DATA_BK1" edc:nzwidth="0x1" edc:desc="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Transfer Direction (only available for control endpoints) (Read/Write)"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x3" edc:desc="Endpoint Type (Read/Write)">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO_OUT" edc:desc="Isochronous OUT" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BULK_OUT" edc:desc="Bulk OUT" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INT_OUT" edc:desc="Interrupt OUT" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ISO_IN" edc:desc="Isochronous IN" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BULK_IN" edc:desc="Bulk IN" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="INT_IN" edc:desc="Interrupt IN" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTGLE" edc:nzwidth="0x1" edc:desc="Data Toggle (Read-only)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EPEDS" edc:nzwidth="0x1" edc:desc="Endpoint Enable Disable"/>
            <edc:SFRFieldDef edc:cname="RXBYTECNT" edc:nzwidth="0xB" edc:desc="Number of Bytes Available in the FIFO (Read-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40044048"/>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FDR0" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40044050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:nzwidth="0x8" edc:desc="FIFO Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FDR1" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40044054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:nzwidth="0x8" edc:desc="FIFO Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FDR2" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40044058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:nzwidth="0x8" edc:desc="FIFO Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FDR3" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4004405C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:nzwidth="0x8" edc:desc="FIFO Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FDR4" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40044060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:nzwidth="0x8" edc:desc="FIFO Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_FDR5" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40044064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:SFRFieldDef edc:cname="FIFO_DATA" edc:nzwidth="0x8" edc:desc="FIFO Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40044068"/>
      <edc:SFRDef ltx:memberofperipheral="UDP" edc:cname="UDP_TXVC" edc:nzwidth="0x20" edc:access="----------------------nn--------" edc:impl="0x300" edc:_addr="0x40044074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UDP">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TXVDIS" edc:nzwidth="0x1" edc:desc="Transceiver Disable"/>
            <edc:SFRFieldDef edc:cname="PUON" edc:nzwidth="0x1" edc:desc="Pull-up On"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F88" edc:_addr="0x40044078"/>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DSCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnn---------" edc:impl="0xFFFFFE00" edc:_addr="0x40048000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="DSCR" edc:nzwidth="0x17" edc:desc="Descriptor Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
