Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40048004"/>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_EN" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40048008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:nzwidth="0x1" edc:desc="DMA Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_DIS" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x4004800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMADIS" edc:nzwidth="0x1" edc:desc="DMA Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_SR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40048010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMASR" edc:nzwidth="0x1" edc:desc="DMA Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_IER" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40048014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIER" edc:nzwidth="0x1" edc:desc="Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_IDR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40048018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIDR" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4004801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIMR" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_ISR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40048020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAISR" edc:nzwidth="0x1" edc:desc="Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40048024"/>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_CR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40048034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="RESET" edc:nzwidth="0x1" edc:desc="CRC Computation Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_MR" edc:nzwidth="0x20" edc:access="--------------n---------nnnnnnnn" edc:impl="0x200FF" edc:_addr="0x40048038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="CRC Enable"/>
            <edc:SFRFieldDef edc:cname="COMPARE" edc:nzwidth="0x1" edc:desc="CRC Compare"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Primitive Polynomial">
              <edc:SFRFieldSemantic edc:cname="CCITT8023" edc:desc="Polynom 0x04C11DB7" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CASTAGNOLI" edc:desc="Polynom 0x1EDC6F41" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CCITT16" edc:desc="Polynom 0x1021" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVIDER" edc:nzwidth="0x4" edc:desc="Request Divider"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BITORDER" edc:nzwidth="0x1" edc:desc="Precomputation Bit Swap Operation of the CRC">
              <edc:SFRFieldSemantic edc:cname="MSBFIRST" edc:desc="CRC computation is performed from the most significant bit to the least significant bit" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LSBFIRST" edc:desc="CRC computation is performed from the least significant bit to the most significant bit" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_SR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4004803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="CRC" edc:nzwidth="0x20" edc:desc="Cyclic Redundancy Check Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_IER" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40048040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIER" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
