Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_IDR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40048044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIDR" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40048048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIMR" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_ISR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4004804C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRISR" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x981B0" edc:_addr="0x40048050"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_MCFG0" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x400E0200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="ULBT" edc:nzwidth="0x3" edc:desc="Undefined Length Burst Type">
              <edc:SFRFieldSemantic edc:cname="UNLIMITED" edc:desc="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_BEAT" edc:desc="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BEAT" edc:desc="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BEAT" edc:desc="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_MCFG1" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x400E0204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="ULBT" edc:nzwidth="0x3" edc:desc="Undefined Length Burst Type">
              <edc:SFRFieldSemantic edc:cname="UNLIMITED" edc:desc="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_BEAT" edc:desc="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BEAT" edc:desc="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BEAT" edc:desc="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_MCFG2" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x400E0208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="ULBT" edc:nzwidth="0x3" edc:desc="Undefined Length Burst Type">
              <edc:SFRFieldSemantic edc:cname="UNLIMITED" edc:desc="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4_BEAT" edc:desc="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BEAT" edc:desc="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BEAT" edc:desc="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
