Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCSR0" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrrrrrrrrrr--------" edc:impl="0x3FFFFF00" edc:_addr="0x400E0418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral Clock 8 Status"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral Clock 9 Status"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral Clock 10 Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral Clock 11 Status"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:nzwidth="0x1" edc:desc="Peripheral Clock 12 Status"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral Clock 13 Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral Clock 14 Status"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral Clock 15 Status"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral Clock 16 Status"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:nzwidth="0x1" edc:desc="Peripheral Clock 17 Status"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral Clock 18 Status"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral Clock 19 Status"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral Clock 20 Status"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral Clock 21 Status"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral Clock 22 Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral Clock 23 Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral Clock 24 Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral Clock 25 Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral Clock 26 Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral Clock 27 Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral Clock 28 Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral Clock 29 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E041C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_MOR" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:impl="0x7FFFF7F" edc:_addr="0x400E0420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTEN" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCXTBY" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Bypass"/>
            <edc:SFRFieldDef edc:cname="WAITMODE" edc:nzwidth="0x1" edc:desc="Wait Mode Command (Write-only)"/>
            <edc:SFRFieldDef edc:cname="MOSCRCEN" edc:nzwidth="0x1" edc:desc="Main On-Chip RC Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCF" edc:nzwidth="0x3" edc:desc="Main On-Chip RC Oscillator Frequency Selection">
              <edc:SFRFieldSemantic edc:cname="_8_MHz" edc:desc="The Fast RC Oscillator frequency is at 8 MHz (default)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_MHz" edc:desc="The Fast RC Oscillator frequency is at 16 MHz" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_24_MHz" edc:desc="The Fast RC Oscillator frequency is at 24 MHz" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCXTST" edc:nzwidth="0x8" edc:desc="Main Crystal Oscillator Start-up Time"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Write Access Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x37"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MOSCSEL" edc:nzwidth="0x1" edc:desc="Main Oscillator Selection"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="XT32KFME" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Frequency Monitoring Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_MCFR" edc:nzwidth="0x20" edc:access="-----------n---nnnnnnnnnnnnnnnnn" edc:impl="0x11FFFF" edc:_addr="0x400E0424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MAINF" edc:nzwidth="0x10" edc:desc="Main Clock Frequency"/>
            <edc:SFRFieldDef edc:cname="MAINFRDY" edc:nzwidth="0x1" edc:desc="Main Clock Frequency Measure Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RCMEAS" edc:nzwidth="0x1" edc:desc="RC Oscillator Frequency Measure (write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_PLLAR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:impl="0x3FFF3FFF" edc:_addr="0x400E0428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLAEN" edc:nzwidth="0x8" edc:desc="PLLA Control"/>
            <edc:SFRFieldDef edc:cname="PLLACOUNT" edc:nzwidth="0x6" edc:desc="PLLA Counter"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MULA" edc:nzwidth="0xD" edc:desc="PLLA Multiplier"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="Must Be Written to 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
