Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK3" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x400E044C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK4" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x400E0450">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK5" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x400E0454">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK6" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x400E0458">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK7" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x400E045C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLB Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IER" edc:nzwidth="0x20" edc:access="----------w--wwwwwwwwwww----wwww" edc:impl="0x27FF0F" edc:_addr="0x400E0460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:nzwidth="0x1" edc:desc="PLLB Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 6 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 7 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Oscillator Selection Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main On-Chip RC Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
