Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_SR0" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrrrrrrrrrr--------" edc:impl="0x3FFFFF00" edc:_addr="0x400E051C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral 9 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:nzwidth="0x1" edc:desc="Peripheral 12 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral 15 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:nzwidth="0x1" edc:desc="Peripheral 17 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral 18 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral 21 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 SleepWalking Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 SleepWalking Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SLPWK_ASR0" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrrrrrrrrrr--------" edc:impl="0x3FFFFF00" edc:_addr="0x400E0520">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral 8 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral 9 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral 10 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral 11 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:nzwidth="0x1" edc:desc="Peripheral 12 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral 13 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral 14 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral 15 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral 16 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:nzwidth="0x1" edc:desc="Peripheral 17 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral 18 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral 19 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral 20 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral 21 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral 22 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral 23 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral 24 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral 25 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral 26 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral 27 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral 28 Activity Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral 29 Activity Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400E0524"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PMMR" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:impl="0x7FF07FF" edc:_addr="0x400E0530">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLA_MMAX" edc:nzwidth="0xB" edc:desc="PLLA Maximum Allowed Multiplier Value"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLLB_MMAX" edc:nzwidth="0xB" edc:desc="PLLB Maximum Allowed Multiplier Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
