Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400E0EE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400E0EEC"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_SCHMITT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400E0F04"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_DRIVER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0F10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="LINE0" edc:nzwidth="0x1" edc:desc="Drive of Line 0">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE1" edc:nzwidth="0x1" edc:desc="Drive of Line 1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE2" edc:nzwidth="0x1" edc:desc="Drive of Line 2">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE3" edc:nzwidth="0x1" edc:desc="Drive of Line 3">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE4" edc:nzwidth="0x1" edc:desc="Drive of Line 4">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE5" edc:nzwidth="0x1" edc:desc="Drive of Line 5">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE6" edc:nzwidth="0x1" edc:desc="Drive of Line 6">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE7" edc:nzwidth="0x1" edc:desc="Drive of Line 7">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE8" edc:nzwidth="0x1" edc:desc="Drive of Line 8">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE9" edc:nzwidth="0x1" edc:desc="Drive of Line 9">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE10" edc:nzwidth="0x1" edc:desc="Drive of Line 10">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE11" edc:nzwidth="0x1" edc:desc="Drive of Line 11">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE12" edc:nzwidth="0x1" edc:desc="Drive of Line 12">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE13" edc:nzwidth="0x1" edc:desc="Drive of Line 13">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE14" edc:nzwidth="0x1" edc:desc="Drive of Line 14">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE15" edc:nzwidth="0x1" edc:desc="Drive of Line 15">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE16" edc:nzwidth="0x1" edc:desc="Drive of Line 16">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE17" edc:nzwidth="0x1" edc:desc="Drive of Line 17">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE18" edc:nzwidth="0x1" edc:desc="Drive of Line 18">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE19" edc:nzwidth="0x1" edc:desc="Drive of Line 19">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE20" edc:nzwidth="0x1" edc:desc="Drive of Line 20">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE21" edc:nzwidth="0x1" edc:desc="Drive of Line 21">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE22" edc:nzwidth="0x1" edc:desc="Drive of Line 22">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE23" edc:nzwidth="0x1" edc:desc="Drive of Line 23">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE24" edc:nzwidth="0x1" edc:desc="Drive of Line 24">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE25" edc:nzwidth="0x1" edc:desc="Drive of Line 25">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE26" edc:nzwidth="0x1" edc:desc="Drive of Line 26">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE27" edc:nzwidth="0x1" edc:desc="Drive of Line 27">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE28" edc:nzwidth="0x1" edc:desc="Drive of Line 28">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE29" edc:nzwidth="0x1" edc:desc="Drive of Line 29">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE30" edc:nzwidth="0x1" edc:desc="Drive of Line 30">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE31" edc:nzwidth="0x1" edc:desc="Drive of Line 31">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
