Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400E10DC"/>
      <edc:SFRDef ltx:memberofperipheral="PIOB" edc:cname="PIOB_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E10E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOB">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x50494F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOB" edc:cname="PIOB_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400E10E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOB">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400E10EC"/>
      <edc:SFRDef ltx:memberofperipheral="PIOB" edc:cname="PIOB_SCHMITT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOB">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400E1104"/>
      <edc:SFRDef ltx:memberofperipheral="PIOB" edc:cname="PIOB_DRIVER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOB">
            <edc:SFRFieldDef edc:cname="LINE0" edc:nzwidth="0x1" edc:desc="Drive of Line 0">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE1" edc:nzwidth="0x1" edc:desc="Drive of Line 1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE2" edc:nzwidth="0x1" edc:desc="Drive of Line 2">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE3" edc:nzwidth="0x1" edc:desc="Drive of Line 3">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE4" edc:nzwidth="0x1" edc:desc="Drive of Line 4">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE5" edc:nzwidth="0x1" edc:desc="Drive of Line 5">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE6" edc:nzwidth="0x1" edc:desc="Drive of Line 6">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE7" edc:nzwidth="0x1" edc:desc="Drive of Line 7">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE8" edc:nzwidth="0x1" edc:desc="Drive of Line 8">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE9" edc:nzwidth="0x1" edc:desc="Drive of Line 9">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE10" edc:nzwidth="0x1" edc:desc="Drive of Line 10">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE11" edc:nzwidth="0x1" edc:desc="Drive of Line 11">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE12" edc:nzwidth="0x1" edc:desc="Drive of Line 12">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE13" edc:nzwidth="0x1" edc:desc="Drive of Line 13">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE14" edc:nzwidth="0x1" edc:desc="Drive of Line 14">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE15" edc:nzwidth="0x1" edc:desc="Drive of Line 15">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE16" edc:nzwidth="0x1" edc:desc="Drive of Line 16">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE17" edc:nzwidth="0x1" edc:desc="Drive of Line 17">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE18" edc:nzwidth="0x1" edc:desc="Drive of Line 18">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE19" edc:nzwidth="0x1" edc:desc="Drive of Line 19">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE20" edc:nzwidth="0x1" edc:desc="Drive of Line 20">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE21" edc:nzwidth="0x1" edc:desc="Drive of Line 21">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE22" edc:nzwidth="0x1" edc:desc="Drive of Line 22">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE23" edc:nzwidth="0x1" edc:desc="Drive of Line 23">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE24" edc:nzwidth="0x1" edc:desc="Drive of Line 24">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE25" edc:nzwidth="0x1" edc:desc="Drive of Line 25">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE26" edc:nzwidth="0x1" edc:desc="Drive of Line 26">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE27" edc:nzwidth="0x1" edc:desc="Drive of Line 27">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE28" edc:nzwidth="0x1" edc:desc="Drive of Line 28">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE29" edc:nzwidth="0x1" edc:desc="Drive of Line 29">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE30" edc:nzwidth="0x1" edc:desc="Drive of Line 30">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE31" edc:nzwidth="0x1" edc:desc="Drive of Line 31">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2EC" edc:_addr="0x400E1114"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RSTC_CR" edc:nzwidth="0x20" edc:access="wwwwwwww--------------------ww-w" edc:impl="0xFF00000D" edc:_addr="0x400E1400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="PROCRST" edc:nzwidth="0x1" edc:desc="Processor Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRST" edc:nzwidth="0x1" edc:desc="Peripheral Reset"/>
            <edc:SFRFieldDef edc:cname="EXTRST" edc:nzwidth="0x1" edc:desc="External Reset"/>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="System Reset Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RSTC_SR" edc:nzwidth="0x20" edc:access="--------------rr-----rrr-------r" edc:impl="0x30701" edc:_addr="0x400E1404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="URSTS" edc:nzwidth="0x1" edc:desc="User Reset Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RSTTYP" edc:nzwidth="0x3" edc:desc="Reset Type">
              <edc:SFRFieldSemantic edc:cname="GENERAL_RST" edc:desc="First power-up reset" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BACKUP_RST" edc:desc="Return from Backup Mode" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WDT_RST" edc:desc="Watchdog fault occurred" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SOFT_RST" edc:desc="Processor reset required by the software" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="USER_RST" edc:desc="NRST pin detected low" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_XTAL_RST" edc:desc="Slow Crystal Failure Detection fault occured" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="NRSTL" edc:nzwidth="0x1" edc:desc="NRST Pin Level"/>
            <edc:SFRFieldDef edc:cname="SRCMP" edc:nzwidth="0x1" edc:desc="Software Reset Command in Progress"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RSTC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn------------nnnn---n--nn" edc:impl="0xFF000F13" edc:_addr="0x400E1408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="URSTEN" edc:nzwidth="0x1" edc:desc="User Reset Enable"/>
            <edc:SFRFieldDef edc:cname="SCKSW" edc:nzwidth="0x1" edc:desc="Slow Clock Switching"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="URSTIEN" edc:nzwidth="0x1" edc:desc="User Reset Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERSTL" edc:nzwidth="0x4" edc:desc="External Reset Length"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Write Access Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E140C"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_CR" edc:nzwidth="0x20" edc:access="wwwwwwww--------------------ww--" edc:impl="0xFF00000C" edc:_addr="0x400E1410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VROFF" edc:nzwidth="0x1" edc:desc="Voltage Regulator Off">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STOP_VREG" edc:desc="If KEY is correct, asserts the system reset signal and stops the voltage regulator." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="XTALSEL" edc:nzwidth="0x1" edc:desc="Crystal Oscillator Select">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYSTAL_SEL" edc:desc="If KEY is correct, switches the slow clock on the crystal oscillator output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
