Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SMMR" edc:nzwidth="0x20" edc:access="------------------nn-nnn----nnnn" edc:impl="0x370F" edc:_addr="0x400E1414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="SMTH" edc:nzwidth="0x4" edc:desc="Supply Monitor Threshold">
              <edc:SFRFieldSemantic edc:cname="V1P6" edc:desc="1.6 V" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="V1P72" edc:desc="1.72 V" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="V1P84" edc:desc="1.84 V" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="V1P96" edc:desc="1.96 V" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="V2P08" edc:desc="2.08 V" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="V2P2" edc:desc="2.2 V" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="V2P32" edc:desc="2.32 V" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="V2P44" edc:desc="2.44 V" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="V2P56" edc:desc="2.56 V" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="V2P68" edc:desc="2.68 V" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="V2P8" edc:desc="2.8 V" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="V2P92" edc:desc="2.92 V" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="V3P04" edc:desc="3.04 V" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="V3P16" edc:desc="3.16 V" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="V3P28" edc:desc="3.28 V" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="V3P4" edc:desc="3.4 V" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SMSMPL" edc:nzwidth="0x3" edc:desc="Supply Monitor Sampling Period">
              <edc:SFRFieldSemantic edc:cname="SMD" edc:desc="Supply Monitor disabled" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CSM" edc:desc="Continuous Supply Monitor" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32SLCK" edc:desc="Supply Monitor enables one SLCK period every 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_256SLCK" edc:desc="Supply Monitor enables one SLCK period every 256 SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_2048SLCK" edc:desc="Supply Monitor enables one SLCK period every 2,048 SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMRSTEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Reset Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMIEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Interrupt Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The SUPC interrupt signal is not affected when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The SUPC interrupt signal is asserted when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnn-----nnn------------" edc:impl="0xFFF07000" edc:_addr="0x400E1418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="BODRSTEN" edc:nzwidth="0x1" edc:desc="POR Core Reset Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a brownout detection occurs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODDIS" edc:nzwidth="0x1" edc:desc="POR Core Disable">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core brownout detector is enabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The core brownout detector is disabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="This bit must always be set to 1."/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OSCBYPASS" edc:nzwidth="0x1" edc:desc="Oscillator Bypass">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect. Clock selection depends on XTALSEL value." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CDPSWITCH" edc:nzwidth="0x1" edc:desc="Cache Data SRAM Power Switch">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The cache data SRAM is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The cache data SRAM is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CTPSWITCH" edc:nzwidth="0x1" edc:desc="Cache Tag SRAM Power Switch">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The cache tag SRAM is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The cache tag SRAM is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ONEA" edc:nzwidth="0x1" edc:desc="This bit must always be set to 1."/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_WUMR" edc:nzwidth="0x20" edc:access="-------------nnn-nnn----nnn-nnn-" edc:impl="0x770EE" edc:_addr="0x400E141C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The supply monitor detection has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The supply monitor detection forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTTEN" edc:nzwidth="0x1" edc:desc="Real-time Timer Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTT alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTCEN" edc:nzwidth="0x1" edc:desc="Real-time Clock Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTC alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN0" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Enable WKUP0">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP0 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP0 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCEN1" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Enable WKUP1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP1 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP1 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCCLR" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Clear">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WKUPDBC" edc:nzwidth="0x3" edc:desc="Wake-up Inputs Debouncer Period">
              <edc:SFRFieldSemantic edc:cname="IMMEDIATE" edc:desc="Immediate, no debouncing, detected active at least on one Slow Clock edge." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_3_SCLK" edc:desc="WKUPx shall be in its active state for at least 3 SLCK periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_SCLK" edc:desc="WKUPx shall be in its active state for at least 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_512_SCLK" edc:desc="WKUPx shall be in its active state for at least 512 SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_4096_SCLK" edc:desc="WKUPx shall be in its active state for at least 4,096 SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32768_SCLK" edc:desc="WKUPx shall be in its active state for at least 32,768 SLCK periods" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBC" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 2 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 3 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 4 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 5 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 6 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 7 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT0" edc:desc="WKUP0/1 in active state for at least 8 RTCOUTx periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
