Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_WUIR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="WKUPEN0" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 0">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN1" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN2" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN3" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN4" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 4">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN5" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 5">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN6" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 6">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN7" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 7">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN8" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 8">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN9" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 9">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN10" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 10">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN11" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 11">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN12" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 12">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN13" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 13">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN14" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 14">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPEN15" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 15">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The corresponding wake-up input has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT0" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 0">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT1" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 1">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT2" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT3" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 3">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT4" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 4">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT5" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 5">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT6" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 6">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT7" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 7">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT8" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 8">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT9" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 9">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT10" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 10">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT11" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 11">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT12" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 12">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT13" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 13">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT14" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 14">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT15" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 15">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
