Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr-rr-----rrrrr-r-" edc:impl="0xFFFF60FA" edc:_addr="0x400E1424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPS" edc:nzwidth="0x1" edc:desc="WKUP Wake-up Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BODRSTS" edc:nzwidth="0x1" edc:desc="Brownout Detector Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No core brownout rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMRSTS" edc:nzwidth="0x1" edc:desc="Supply Monitor Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMS" edc:nzwidth="0x1" edc:desc="Supply Monitor Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMOS" edc:nzwidth="0x1" edc:desc="Supply Monitor Output Status">
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="The supply monitor detected VDDIO higher than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="The supply monitor detected VDDIO lower than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSCSEL" edc:nzwidth="0x1" edc:desc="32-kHz Oscillator Selection Status">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The slow clock SLCK is generated by the 32 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPDBCS0" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Wake-up Status on WKUP0 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCS1" edc:nzwidth="0x1" edc:desc="Low-power Debouncer Wake-up Status on WKUP1 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wake-up due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPIS0" edc:nzwidth="0x1" edc:desc="WKUP Input Status 0 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS1" edc:nzwidth="0x1" edc:desc="WKUP Input Status 1 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS2" edc:nzwidth="0x1" edc:desc="WKUP Input Status 2 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS3" edc:nzwidth="0x1" edc:desc="WKUP Input Status 3 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS4" edc:nzwidth="0x1" edc:desc="WKUP Input Status 4 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS5" edc:nzwidth="0x1" edc:desc="WKUP Input Status 5 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS6" edc:nzwidth="0x1" edc:desc="WKUP Input Status 6 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS7" edc:nzwidth="0x1" edc:desc="WKUP Input Status 7 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS8" edc:nzwidth="0x1" edc:desc="WKUP Input Status 8 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS9" edc:nzwidth="0x1" edc:desc="WKUP Input Status 9 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS10" edc:nzwidth="0x1" edc:desc="WKUP Input Status 10 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS11" edc:nzwidth="0x1" edc:desc="WKUP Input Status 11 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS12" edc:nzwidth="0x1" edc:desc="WKUP Input Status 12 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS13" edc:nzwidth="0x1" edc:desc="WKUP Input Status 13 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS14" edc:nzwidth="0x1" edc:desc="WKUP Input Status 14 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS15" edc:nzwidth="0x1" edc:desc="WKUP Input Status 15 (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E1428"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_PWMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnnn--nnnnn" edc:impl="0xFFFF1F9F" edc:_addr="0x400E142C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPOWERS" edc:nzwidth="0x1" edc:desc="Low Power Value Selection">
              <edc:SFRFieldSemantic edc:cname="FACTORY" edc:desc="The trimming value applied to the regulator when the device is in Wait mode. This value is factory-defined." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER" edc:desc="The trimming value applied to the regulator is defined by the value programmed in the LPOWERx bits." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPOWER0" edc:nzwidth="0x1" edc:desc="Low Power Value"/>
            <edc:SFRFieldDef edc:cname="LPOWER1" edc:nzwidth="0x1" edc:desc="Low Power Value"/>
            <edc:SFRFieldDef edc:cname="LPOWER2" edc:nzwidth="0x1" edc:desc="Low Power Value"/>
            <edc:SFRFieldDef edc:cname="LPOWER3" edc:nzwidth="0x1" edc:desc="Low Power Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="STUPTIME" edc:nzwidth="0x1" edc:desc="Start-up Time when Resuming from Wait Mode">
              <edc:SFRFieldSemantic edc:cname="FAST" edc:desc="Fast start-up." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SLOW" edc:desc="Slow start-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ECPWRS" edc:nzwidth="0x1" edc:desc="Enhanced Custom Power Value Selection">
              <edc:SFRFieldSemantic edc:cname="FACTORY" edc:desc="The trimming value applied to the regulator when the device is in Active mode. This value is factory-defined." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER" edc:desc="The trimming value applied to the regulator is defined by the value programmed in ECPWRx bits." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ECPWR0" edc:nzwidth="0x1" edc:desc="Enhanced Custom Power Value"/>
            <edc:SFRFieldDef edc:cname="ECPWR1" edc:nzwidth="0x1" edc:desc="Enhanced Custom Power Value"/>
            <edc:SFRFieldDef edc:cname="ECPWR2" edc:nzwidth="0x1" edc:desc="Enhanced Custom Power Value"/>
            <edc:SFRFieldDef edc:cname="ECPWR3" edc:nzwidth="0x1" edc:desc="Enhanced Custom Power Value"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SRAM0ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM1ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM2ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM3ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM4ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM5ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAM6ON" edc:nzwidth="0x1" edc:desc="SRAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SRAMx is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="SRAMx is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPRAMON" edc:nzwidth="0x1" edc:desc="Dual-port RAM Power Control">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="USB dual-port RAM is not powered." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="USB dual-port RAM is powered." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
