Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_MR" edc:nzwidth="0x20" edc:access="--nn-nnn-nnn-nnnnnnnnnnn---n--nn" edc:impl="0x3777FF13" edc:_addr="0x400E1464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="HRMOD" edc:nzwidth="0x1" edc:desc="12-/24-hour Mode"/>
            <edc:SFRFieldDef edc:cname="PERSIAN" edc:nzwidth="0x1" edc:desc="PERSIAN Calendar"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NEGPPM" edc:nzwidth="0x1" edc:desc="NEGative PPM Correction"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CORRECTION" edc:nzwidth="0x7" edc:desc="Slow Clock Correction"/>
            <edc:SFRFieldDef edc:cname="HIGHPPM" edc:nzwidth="0x1" edc:desc="HIGH PPM Correction"/>
            <edc:SFRFieldDef edc:cname="OUT0" edc:nzwidth="0x3" edc:desc="RTCOUT0 OutputSource Selection">
              <edc:SFRFieldSemantic edc:cname="NO_WAVE" edc:desc="No waveform, stuck at '0'" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FREQ1HZ" edc:desc="1 Hz square wave" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FREQ32HZ" edc:desc="32 Hz square wave" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FREQ64HZ" edc:desc="64 Hz square wave" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="FREQ512HZ" edc:desc="512 Hz square wave" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_TOGGLE" edc:desc="Output toggles when alarm flag rises" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_FLAG" edc:desc="Output is a copy of the alarm flag" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PROG_PULSE" edc:desc="Duty cycle programmable pulse" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT1" edc:nzwidth="0x3" edc:desc="RTCOUT1 Output Source Selection">
              <edc:SFRFieldSemantic edc:cname="NO_WAVE" edc:desc="No waveform, stuck at '0'" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FREQ1HZ" edc:desc="1 Hz square wave" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FREQ32HZ" edc:desc="32 Hz square wave" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FREQ64HZ" edc:desc="64 Hz square wave" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="FREQ512HZ" edc:desc="512 Hz square wave" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_TOGGLE" edc:desc="Output toggles when alarm flag rises" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_FLAG" edc:desc="Output is a copy of the alarm flag" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PROG_PULSE" edc:desc="Duty cycle programmable pulse" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THIGH" edc:nzwidth="0x3" edc:desc="High Duration of the Output Pulse">
              <edc:SFRFieldSemantic edc:cname="H_31MS" edc:desc="31.2 ms" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="H_16MS" edc:desc="15.6 ms" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="H_4MS" edc:desc="3.91 ms" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="H_976US" edc:desc="976 us" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="H_488US" edc:desc="488 us" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="H_122US" edc:desc="122 us" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="H_30US" edc:desc="30.5 us" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H_15US" edc:desc="15.2 us" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TPERIOD" edc:nzwidth="0x2" edc:desc="Period of the Output Pulse">
              <edc:SFRFieldSemantic edc:cname="P_1S" edc:desc="1 second" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="P_500MS" edc:desc="500 ms" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="P_250MS" edc:desc="250 ms" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="P_125MS" edc:desc="125 ms" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TIMR" edc:nzwidth="0x20" edc:access="---------nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x7F7F7F" edc:_addr="0x400E1468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Current Second"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Current Minute"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Current Hour"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="Ante Meridiem Post Meridiem Indicator"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_CALR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:impl="0x3FFFFF7F" edc:_addr="0x400E146C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="CENT" edc:nzwidth="0x7" edc:desc="Current Century"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x8" edc:desc="Current Year"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Current Month"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Current Day in Current Week"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Current Day in Current Month"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TIMALR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x400E1470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Second Alarm"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:nzwidth="0x1" edc:desc="Second Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minute Alarm"/>
            <edc:SFRFieldDef edc:cname="MINEN" edc:nzwidth="0x1" edc:desc="Minute Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hour Alarm"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator"/>
            <edc:SFRFieldDef edc:cname="HOUREN" edc:nzwidth="0x1" edc:desc="Hour Alarm Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_CALALR" edc:nzwidth="0x20" edc:access="n-nnnnnnn--nnnnn----------------" edc:impl="0xBF9F0000" edc:_addr="0x400E1474">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month Alarm"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MTHEN" edc:nzwidth="0x1" edc:desc="Month Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date Alarm"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATEEN" edc:nzwidth="0x1" edc:desc="Date Alarm Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x400E1478">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKUPD" edc:nzwidth="0x1" edc:desc="Acknowledge for Update">
              <edc:SFRFieldSemantic edc:cname="FREERUN" edc:desc="Time and calendar registers cannot be updated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Time and calendar registers can be updated." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALARM" edc:nzwidth="0x1" edc:desc="Alarm Flag">
              <edc:SFRFieldSemantic edc:cname="NO_ALARMEVENT" edc:desc="No alarm matching condition occurred." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ALARMEVENT" edc:desc="An alarm matching condition has occurred." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x1" edc:desc="Second Event">
              <edc:SFRFieldSemantic edc:cname="NO_SECEVENT" edc:desc="No second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SECEVENT" edc:desc="At least one second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TIMEV" edc:nzwidth="0x1" edc:desc="Time Event">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEVENT" edc:desc="No time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TIMEVENT" edc:desc="At least one time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CALEV" edc:nzwidth="0x1" edc:desc="Calendar Event">
              <edc:SFRFieldSemantic edc:cname="NO_CALEVENT" edc:desc="No calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CALEVENT" edc:desc="At least one calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TDERR" edc:nzwidth="0x1" edc:desc="Time and/or Date Free Running Error">
              <edc:SFRFieldSemantic edc:cname="CORRECT" edc:desc="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ERR_TIMEDATE" edc:desc="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SCCR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x400E147C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKCLR" edc:nzwidth="0x1" edc:desc="Acknowledge Clear"/>
            <edc:SFRFieldDef edc:cname="ALRCLR" edc:nzwidth="0x1" edc:desc="Alarm Clear"/>
            <edc:SFRFieldDef edc:cname="SECCLR" edc:nzwidth="0x1" edc:desc="Second Clear"/>
            <edc:SFRFieldDef edc:cname="TIMCLR" edc:nzwidth="0x1" edc:desc="Time Clear"/>
            <edc:SFRFieldDef edc:cname="CALCLR" edc:nzwidth="0x1" edc:desc="Calendar Clear"/>
            <edc:SFRFieldDef edc:cname="TDERRCLR" edc:nzwidth="0x1" edc:desc="Time and/or Date Free Running Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IER" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x400E1480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKEN" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ALREN" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TIMEN" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CALEN" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDERREN" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IDR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x400E1484">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKDIS" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ALRDIS" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SECDIS" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TIMDIS" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CALDIS" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TDERRDIS" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
