Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
      <edc:DCRDef ltx:memberofperipheral="LOCKBIT" edc:cname="LOCKBIT_WORD1" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_32" edc:nzwidth="0x1" edc:desc="Lock Region 32">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_33" edc:nzwidth="0x1" edc:desc="Lock Region 33">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_34" edc:nzwidth="0x1" edc:desc="Lock Region 34">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_35" edc:nzwidth="0x1" edc:desc="Lock Region 35">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_36" edc:nzwidth="0x1" edc:desc="Lock Region 36">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_37" edc:nzwidth="0x1" edc:desc="Lock Region 37">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_38" edc:nzwidth="0x1" edc:desc="Lock Region 38">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_39" edc:nzwidth="0x1" edc:desc="Lock Region 39">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_40" edc:nzwidth="0x1" edc:desc="Lock Region 40">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_41" edc:nzwidth="0x1" edc:desc="Lock Region 41">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_42" edc:nzwidth="0x1" edc:desc="Lock Region 42">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_43" edc:nzwidth="0x1" edc:desc="Lock Region 43">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_44" edc:nzwidth="0x1" edc:desc="Lock Region 44">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_45" edc:nzwidth="0x1" edc:desc="Lock Region 45">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_46" edc:nzwidth="0x1" edc:desc="Lock Region 46">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_47" edc:nzwidth="0x1" edc:desc="Lock Region 47">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_48" edc:nzwidth="0x1" edc:desc="Lock Region 48">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_49" edc:nzwidth="0x1" edc:desc="Lock Region 49">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_50" edc:nzwidth="0x1" edc:desc="Lock Region 50">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_51" edc:nzwidth="0x1" edc:desc="Lock Region 51">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_52" edc:nzwidth="0x1" edc:desc="Lock Region 52">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_53" edc:nzwidth="0x1" edc:desc="Lock Region 53">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_54" edc:nzwidth="0x1" edc:desc="Lock Region 54">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_55" edc:nzwidth="0x1" edc:desc="Lock Region 55">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_56" edc:nzwidth="0x1" edc:desc="Lock Region 56">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_57" edc:nzwidth="0x1" edc:desc="Lock Region 57">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_58" edc:nzwidth="0x1" edc:desc="Lock Region 58">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_59" edc:nzwidth="0x1" edc:desc="Lock Region 59">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_60" edc:nzwidth="0x1" edc:desc="Lock Region 60">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_61" edc:nzwidth="0x1" edc:desc="Lock Region 61">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_62" edc:nzwidth="0x1" edc:desc="Lock Region 62">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_63" edc:nzwidth="0x1" edc:desc="Lock Region 63">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="I2SCK0" edc:ppsfunction="A" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="WKUP0" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="I2SWS0" edc:ppsfunction="A" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="WKUP1" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="A" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="I2SDI0" edc:ppsfunction="B" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="WKUP2" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI3_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI3"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI3"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="I2SDO0" edc:ppsfunction="B" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI3_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI3"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI3"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="I2SMCK0" edc:ppsfunction="B" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI2_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI2"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI2"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="SPI5_NPCS1" edc:ppsfunction="B" ltx:memberofperipheral="SPI5"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="B" ltx:memberofperipheral="USART5"/>
      <edc:VirtualPin edc:name="WKUP4" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI2_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI2"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI2"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="WKUP5" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI0_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="PDMIC0_DAT" edc:ppsfunction="B" ltx:memberofperipheral="PDMIC0"/>
      <edc:VirtualPin edc:name="WKUP6" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI0_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="PDMIC0_CLK" edc:ppsfunction="B" ltx:memberofperipheral="PDMIC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI5_NPCS0" edc:ppsfunction="A" ltx:memberofperipheral="SPI5"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="A" ltx:memberofperipheral="USART5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI5_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI5"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI5"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI5_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI5"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI5"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI5_SPCK" edc:ppsfunction="A" ltx:memberofperipheral="SPI5"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="A" ltx:memberofperipheral="USART5"/>
      <edc:VirtualPin edc:name="WKUP8" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI2_NPCS1" edc:ppsfunction="A" ltx:memberofperipheral="SPI2"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="A" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="SPI2_SPCK" edc:ppsfunction="B" ltx:memberofperipheral="SPI2"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI2_NPCS0" edc:ppsfunction="A" ltx:memberofperipheral="SPI2"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="A" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="TIOB1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="WKUP7" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="I2SDO0" edc:ppsfunction="A" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="I2SMCK0" edc:ppsfunction="A" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="A" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="I2SCK1" edc:ppsfunction="B" ltx:memberofperipheral="I2SC1"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TCLK2" edc:ppsfunction="A" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="I2SWS1" edc:ppsfunction="B" ltx:memberofperipheral="I2SC1"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TIOA2" edc:ppsfunction="A" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="DM" edc:ppsfunction="X1" ltx:memberofperipheral="UHP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="A" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="I2SDI1" edc:ppsfunction="B" ltx:memberofperipheral="I2SC1"/>
      <edc:VirtualPin edc:name="DP" edc:ppsfunction="X1" ltx:memberofperipheral="UHP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="I2SDO1" edc:ppsfunction="A" ltx:memberofperipheral="I2SC1"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="WKUP3" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="I2SMCK1" edc:ppsfunction="A" ltx:memberofperipheral="I2SC1"/>
      <edc:VirtualPin edc:name="SPI2_SPCK" edc:ppsfunction="B" ltx:memberofperipheral="SPI2"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="B" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="WKUP11" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI0_NPCS0" edc:ppsfunction="A" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="A" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="I2SDO1" edc:ppsfunction="B" ltx:memberofperipheral="I2SC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA26" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI0_NPCS1" edc:ppsfunction="A" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="A" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="I2SMCK1" edc:ppsfunction="B" ltx:memberofperipheral="I2SC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI1_SPCK" edc:ppsfunction="A" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="SPI7_MISO" edc:ppsfunction="B" ltx:memberofperipheral="SPI7"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="B" ltx:memberofperipheral="TWI7"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="B" ltx:memberofperipheral="USART7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI1_NPCS0" edc:ppsfunction="A" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="SPI7_MOSI" edc:ppsfunction="B" ltx:memberofperipheral="SPI7"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="B" ltx:memberofperipheral="TWI7"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="B" ltx:memberofperipheral="USART7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA29" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SPI1_NPCS1" edc:ppsfunction="A" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="SPI7_SPCK" edc:ppsfunction="B" ltx:memberofperipheral="SPI7"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="B" ltx:memberofperipheral="USART7"/>
    </edc:Pin>
