Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg55/edc/ATSAMG55J19.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="SPI7_NPCS0" edc:ppsfunction="B" ltx:memberofperipheral="SPI7"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="B" ltx:memberofperipheral="USART7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="SPI7_NPCS1" edc:ppsfunction="B" ltx:memberofperipheral="SPI7"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="B" ltx:memberofperipheral="USART7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI0_SPCK" edc:ppsfunction="A" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="A" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="SPI6_MOSI" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="B" ltx:memberofperipheral="TWI6"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
      <edc:VirtualPin edc:name="AD4" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI4_SPCK" edc:ppsfunction="A" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="A" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="SPI6_MISO" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="B" ltx:memberofperipheral="TWI6"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI1_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="SPI5_NPCS1" edc:ppsfunction="B" ltx:memberofperipheral="SPI5"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="B" ltx:memberofperipheral="USART5"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI1_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="TRACESWO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDIO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDCLK" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI4_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI4"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="SPI4_NPCS0" edc:ppsfunction="B" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="B" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="WKUP14" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI4_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI4"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="SPI4_NPCS1" edc:ppsfunction="B" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="B" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="WKUP15" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI4_MOSI" edc:ppsfunction="A" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="A" ltx:memberofperipheral="TWI4"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="A" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="SPI6_MOSI" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="TWD" edc:ppsfunction="B" ltx:memberofperipheral="TWI6"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI4_MISO" edc:ppsfunction="A" ltx:memberofperipheral="SPI4"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="A" ltx:memberofperipheral="TWI4"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="A" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="SPI6_MISO" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="TWCK" edc:ppsfunction="B" ltx:memberofperipheral="TWI6"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="ERASE" edc:ppsfunction="X1" ltx:memberofperipheral="EFC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI3_SPCK" edc:ppsfunction="A" ltx:memberofperipheral="SPI3"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="A" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="SPI6_SPCK" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI3_NPCS0" edc:ppsfunction="A" ltx:memberofperipheral="SPI3"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="A" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="SPI6_NPCS0" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="CTS" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB15" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="SPI3_NPCS1" edc:ppsfunction="A" ltx:memberofperipheral="SPI3"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="A" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="SPI6_NPCS1" edc:ppsfunction="B" ltx:memberofperipheral="SPI6"/>
      <edc:VirtualPin edc:name="RTS" edc:ppsfunction="B" ltx:memberofperipheral="USART6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREF"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TEST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
